from django.db import models
from pages.models import Page


class MapAreaLink (models.Model):
	MAP_AREA_CHOICES = [
		('01', 'Скрининг'),
		('02', 'Сбор информации'),
		('03', 'Анализ'),
		('04', 'Исследование рынка'),
		('05', 'Разработка концепции'),
		('06', 'Выбор концепции'),
		('07', 'Планирование'),
		('08', 'Разработка прототипа'),
		('09', 'ТЗ'),
		('10', 'КД'),
		('11', 'ПО'),
		('12', 'Документация'),
		('13', 'Сборка прототипа'),
		('14', 'Подготовка производства'),
		('15', 'Альфа-тестирование'),
		('16', 'Бета-тестирование'),
		('17', 'Создание продукта'),
		('18', 'Разработка продукта'),
		('19', 'Уточнение ТЗ'),
		('20', 'Доработка КД'),
		('21', 'Обеспечение производства'),
		('22', 'Вывод на рынок и продажи'),
		('23', 'Итерационная доработка'),
		('24', 'Поддержка'),
		('25', 'Вывод с рынка'),
	]

	map_area = models.CharField(max_length=100, choices=MAP_AREA_CHOICES, verbose_name='Область рисунка', unique=True)
	page = models.ForeignKey(Page, verbose_name='Страница', on_delete=models.CASCADE)  


	def __str__(self):
		return self.get_map_area_display()

	class Meta:
		verbose_name = 'Ссылка на карте процесса'
		verbose_name_plural = 'Ссылки на карте процесса'